In [1]:
import pandas as pd

print("Environment is working!")

Environment is working!

In [2]:
import sys
print(sys.executable)

c:\Users\User\anaconda3\envs\dfsagemaker\python.exe

In [3]:
import pandas as pd

train = pd.read_csv("../data/train.csv")
stores = pd.read_csv("../data/stores.csv")

print("Train shape:", train.shape)
print("Stores shape:", stores.shape)

Train shape: (3000888, 6)
Stores shape: (54, 5)

In [4]:
train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [5]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         object
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 137.4+ MB

In [6]:
train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [9]:
train[["date", "store_nbr", "family", "sales"]].head()

         date  store_nbr      family  sales
0  2013-01-01          1  AUTOMOTIVE    0.0
1  2013-01-01          1   BABY CARE    0.0
2  2013-01-01          1      BEAUTY    0.0
3  2013-01-01          1   BEVERAGES    0.0
4  2013-01-01          1       BOOKS    0.0